susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32F72x.h
#define FMC_NE4_PG12_ PG12,GPIO_AF12
#define _FMC_NE4_PG12_ 1

#define FMC_NL_PB7_ PB7,GPIO_AF12
#define _FMC_NL_PB7_ 1

#define FMC_NOE_PD4_ PD4,GPIO_AF12
#define _FMC_NOE_PD4_ 1

#define FMC_NWAIT_PD6_ PD6,GPIO_AF12
#define _FMC_NWAIT_PD6_ 1

#define FMC_NWE_PD5_ PD5,GPIO_AF12
#define _FMC_NWE_PD5_ 1

#define FMC_SDCKE0_PC3_ PC3,GPIO_AF12
#define FMC_SDCKE0_PC5_ PC5,GPIO_AF12
#define FMC_SDCKE0_PH2_ PH2,GPIO_AF12
#define _FMC_SDCKE0_PC3_ 1
#define _FMC_SDCKE0_PC5_ 1
#define _FMC_SDCKE0_PH2_ 1

#define FMC_SDCKE1_PB5_ PB5,GPIO_AF12
#define FMC_SDCKE1_PH7_ PH7,GPIO_AF12
#define _FMC_SDCKE1_PB5_ 1
#define _FMC_SDCKE1_PH7_ 1

#define FMC_SDCLK_PG8_ PG8,GPIO_AF12
#define _FMC_SDCLK_PG8_ 1

#define FMC_SDNCAS_PG15_ PG15,GPIO_AF12
#define _FMC_SDNCAS_PG15_ 1

#define FMC_SDNE0_PC2_ PC2,GPIO_AF12
#define FMC_SDNE0_PC4_ PC4,GPIO_AF12
#define FMC_SDNE0_PH3_ PH3,GPIO_AF12
#define _FMC_SDNE0_PC2_ 1
#define _FMC_SDNE0_PC4_ 1
#define _FMC_SDNE0_PH3_ 1

#define FMC_SDNE1_PB6_ PB6,GPIO_AF12
#define FMC_SDNE1_PH6_ PH6,GPIO_AF12
#define _FMC_SDNE1_PB6_ 1
#define _FMC_SDNE1_PH6_ 1

#define FMC_SDNRAS_PF11_ PF11,GPIO_AF12
#define _FMC_SDNRAS_PF11_ 1

#define FMC_SDNWE_PA7_ PA7,GPIO_AF12
#define FMC_SDNWE_PC0_ PC0,GPIO_AF12
#define FMC_SDNWE_PH5_ PH5,GPIO_AF12
#define _FMC_SDNWE_PA7_ 1
#define _FMC_SDNWE_PC0_ 1
#define _FMC_SDNWE_PH5_ 1

#define I2C1_SCL_PB6_ PB6,GPIO_AF4
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PB7_ PB7,GPIO_AF4
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PB5_ PB5,GPIO_AF4
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PB10_ PB10,GPIO_AF4
#define I2C2_SCL_PF1_ PF1,GPIO_AF4
#define I2C2_SCL_PH4_ PH4,GPIO_AF4
#define _I2C2_SCL_PB10_ 1
#define _I2C2_SCL_PF1_ 1
#define _I2C2_SCL_PH4_ 1

#define I2C2_SDA_PB11_ PB11,GPIO_AF4
#define I2C2_SDA_PF0_ PF0,GPIO_AF4
#define I2C2_SDA_PH5_ PH5,GPIO_AF4
#define _I2C2_SDA_PB11_ 1
#define _I2C2_SDA_PF0_ 1
#define _I2C2_SDA_PH5_ 1

#define I2C2_SMBA_PB12_ PB12,GPIO_AF4
#define I2C2_SMBA_PF2_ PF2,GPIO_AF4
#define I2C2_SMBA_PH6_ PH6,GPIO_AF4
#define _I2C2_SMBA_PB12_ 1
#define _I2C2_SMBA_PF2_ 1
#define _I2C2_SMBA_PH6_ 1

#define I2C3_SCL_PA8_ PA8,GPIO_AF4
#define I2C3_SCL_PH7_ PH7,GPIO_AF4
#define _I2C3_SCL_PA8_ 1
#define _I2C3_SCL_PH7_ 1

#define I2C3_SDA_PC9_ PC9,GPIO_AF4
#define I2C3_SDA_PH8_ PH8,GPIO_AF4
#define _I2C3_SDA_PC9_ 1
#define _I2C3_SDA_PH8_ 1

#define I2C3_SMBA_PA9_ PA9,GPIO_AF4
#define I2C3_SMBA_PH9_ PH9,GPIO_AF4
#define _I2C3_SMBA_PA9_ 1
#define _I2C3_SMBA_PH9_ 1

#define I2S1_CK_PA5_ PA5,GPIO_AF5
#define I2S1_CK_PB3_ PB3,GPIO_AF5
#define _I2S1_CK_PA5_ 1
#define _I2S1_CK_PB3_ 1

#define I2S1_MCK_PC4_ PC4,GPIO_AF5
#define _I2S1_MCK_PC4_ 1

#define I2S1_SD_PA7_ PA7,GPIO_AF5
#define I2S1_SD_PB5_ PB5,GPIO_AF5
#define _I2S1_SD_PA7_ 1
#define _I2S1_SD_PB5_ 1

#define I2S1_WS_PA15_ PA15,GPIO_AF5
#define I2S1_WS_PA4_ PA4,GPIO_AF5
#define _I2S1_WS_PA15_ 1
#define _I2S1_WS_PA4_ 1

#define I2S2_CK_PA9_ PA9,GPIO_AF5
#define I2S2_CK_PB10_ PB10,GPIO_AF5
#define I2S2_CK_PB13_ PB13,GPIO_AF5
#define I2S2_CK_PD3_ PD3,GPIO_AF5
#define I2S2_CK_PI1_ PI1,GPIO_AF5
#define _I2S2_CK_PA9_ 1
#define _I2S2_CK_PB10_ 1
#define _I2S2_CK_PB13_ 1
#define _I2S2_CK_PD3_ 1
#define _I2S2_CK_PI1_ 1

#define I2S2_MCK_PC6_ PC6,GPIO_AF5
#define _I2S2_MCK_PC6_ 1

#define I2S2_SD_PB15_ PB15,GPIO_AF5
#define I2S2_SD_PC1_ PC1,GPIO_AF5
#define I2S2_SD_PC3_ PC3,GPIO_AF5
#define I2S2_SD_PI3_ PI3,GPIO_AF5
#define _I2S2_SD_PB15_ 1
#define _I2S2_SD_PC1_ 1
#define _I2S2_SD_PC3_ 1
#define _I2S2_SD_PI3_ 1

#define I2S2_WS_PB12_ PB12,GPIO_AF5
#define I2S2_WS_PB4_ PB4,GPIO_AF7
#define I2S2_WS_PB9_ PB9,GPIO_AF5
#define I2S2_WS_PI0_ PI0,GPIO_AF5
#define _I2S2_WS_PB12_ 1
#define _I2S2_WS_PB4_ 1
#define _I2S2_WS_PB9_ 1
#define _I2S2_WS_PI0_ 1

#define I2S3_CK_PB3_ PB3,GPIO_AF6
#define I2S3_CK_PC10_ PC10,GPIO_AF6
#define _I2S3_CK_PB3_ 1
#define _I2S3_CK_PC10_ 1

#define I2S3_MCK_PC7_ PC7,GPIO_AF6
#define _I2S3_MCK_PC7_ 1

#define I2S3_SD_PB2_ PB2,GPIO_AF7
#define I2S3_SD_PB5_ PB5,GPIO_AF6
#define I2S3_SD_PC12_ PC12,GPIO_AF6
#define I2S3_SD_PD6_ PD6,GPIO_AF5
#define _I2S3_SD_PB2_ 1
#define _I2S3_SD_PB5_ 1
#define _I2S3_SD_PC12_ 1
#define _I2S3_SD_PD6_ 1

#define I2S3_WS_PA15_ PA15,GPIO_AF6
#define I2S3_WS_PA4_ PA4,GPIO_AF6
#define _I2S3_WS_PA15_ 1
#define _I2S3_WS_PA4_ 1

#define I2S_CKIN_PC9_ PC9,GPIO_AF5
#define _I2S_CKIN_PC9_ 1

#define LPTIM1_ETR_PE0_ PE0,GPIO_AF3
#define LPTIM1_ETR_PG14_ PG14,GPIO_AF3
#define _LPTIM1_ETR_PE0_ 1
#define _LPTIM1_ETR_PG14_ 1

#define LPTIM1_IN1_PD12_ PD12,GPIO_AF3
#define LPTIM1_IN1_PG12_ PG12,GPIO_AF3
#define _LPTIM1_IN1_PD12_ 1
#define _LPTIM1_IN1_PG12_ 1

#define LPTIM1_IN2_PE1_ PE1,GPIO_AF3
#define LPTIM1_IN2_PH2_ PH2,GPIO_AF3
#define _LPTIM1_IN2_PE1_ 1
#define _LPTIM1_IN2_PH2_ 1

#define LPTIM1_OUT_PD13_ PD13,GPIO_AF3
#define LPTIM1_OUT_PG13_ PG13,GPIO_AF3
#define _LPTIM1_OUT_PD13_ 1
#define _LPTIM1_OUT_PG13_ 1

#define QUADSPI_BK1_IO0_PC9_ PC9,GPIO_AF9
#define QUADSPI_BK1_IO0_PD11_ PD11,GPIO_AF9
#define QUADSPI_BK1_IO0_PF8_ PF8,GPIO_AF10
#define _QUADSPI_BK1_IO0_PC9_ 1
#define _QUADSPI_BK1_IO0_PD11_ 1
#define _QUADSPI_BK1_IO0_PF8_ 1

#define QUADSPI_BK1_IO1_PC10_ PC10,GPIO_AF9
#define QUADSPI_BK1_IO1_PD12_ PD12,GPIO_AF9
#define QUADSPI_BK1_IO1_PF9_ PF9,GPIO_AF10
#define _QUADSPI_BK1_IO1_PC10_ 1
#define _QUADSPI_BK1_IO1_PD12_ 1
#define _QUADSPI_BK1_IO1_PF9_ 1

#define QUADSPI_BK1_IO2_PE2_ PE2,GPIO_AF9
#define QUADSPI_BK1_IO2_PF7_ PF7,GPIO_AF9
#define _QUADSPI_BK1_IO2_PE2_ 1
#define _QUADSPI_BK1_IO2_PF7_ 1

#define QUADSPI_BK1_IO3_PA1_ PA1,GPIO_AF9
#define QUADSPI_BK1_IO3_PD13_ PD13,GPIO_AF9
#define QUADSPI_BK1_IO3_PF6_ PF6,GPIO_AF9
#define _QUADSPI_BK1_IO3_PA1_ 1
#define _QUADSPI_BK1_IO3_PD13_ 1
#define _QUADSPI_BK1_IO3_PF6_ 1

#define QUADSPI_BK1_NCS_PB6_ PB6,GPIO_AF10
#define _QUADSPI_BK1_NCS_PB6_ 1

#define QUADSPI_BK2_IO0_PE7_ PE7,GPIO_AF10
#define QUADSPI_BK2_IO0_PH2_ PH2,GPIO_AF9
#define _QUADSPI_BK2_IO0_PE7_ 1
#define _QUADSPI_BK2_IO0_PH2_ 1

#define QUADSPI_BK2_IO1_PE8_ PE8,GPIO_AF10
#define QUADSPI_BK2_IO1_PH3_ PH3,GPIO_AF9
#define _QUADSPI_BK2_IO1_PE8_ 1
#define _QUADSPI_BK2_IO1_PH3_ 1

#define QUADSPI_BK2_IO2_PE9_ PE9,GPIO_AF10
#define QUADSPI_BK2_IO2_PG9_ PG9,GPIO_AF9
#define _QUADSPI_BK2_IO2_PE9_ 1
#define _QUADSPI_BK2_IO2_PG9_ 1

#define QUADSPI_BK2_IO3_PE10_ PE10,GPIO_AF10
#define QUADSPI_BK2_IO3_PG14_ PG14,GPIO_AF9
#define _QUADSPI_BK2_IO3_PE10_ 1
#define _QUADSPI_BK2_IO3_PG14_ 1

